Revit 2024 API
ReferenceIntersector Methods
The ReferenceIntersector type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Find
 Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.
FindNearest
 Projects a ray from the origin along the given direction, and returns the nearest reference from intersected elements which match the ReferenceIntersector's criteria.
GetFilter
 Gets the ElementFilter used in intersection testing.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetTargetElementIds
 Gets the set of ElementIds to test from in intersection testing.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetFilter
 Sets the ElementFilter used in intersection testing.
SetTargetElementIds
 Sets the set of ElementIds to test from in intersection testing.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ReferenceIntersector Class
Autodesk.Revit.DB Namespace